app/views/assignments/new.html.haml

            = label :label_horse1, :horse1, 'Horse 1: '
            = collection_select :a, :horse1, Horse.all, :id, :name
---
SELECT "horses".* FROM "horses"