app/views/practices/show.html.haml

            %td= link_to "View Sign Ups", assignments_path(p: practice)
            %td= practice.user.first_name + " " + practice.user.last_name
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]