app/controllers/assignments_controller.rb

	def show
	  session[:practice] = params["p"] # Pass in practice that we are accessing
	  @assignments = current_practice.assignments.all
---
SELECT "assignments".* FROM "assignments" WHERE "assignments"."practice_id" = $1  [["practice_id", 27]]

	def create
	  @assignment = current_practice.assignments.create
	  @assignment.user = current_user
	  @assignment.horse1 = Horse.find_by(id: params["a"]["horse1"])
	  @assignment.horse2 = Horse.find_by(id: params["a"]["horse2"])
	  @assignment.horse3 = Horse.find_by(id: params["a"]["horse3"])
	  @assignment.note = params["a"]["note"]

	  p current_practice.assignments.all

	  if @assignment.save
---
INSERT INTO "assignments" ("user_id", "note", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["note", ""], ["created_at", "2019-04-16 23:32:09.383023"], ["updated_at", "2019-04-16 23:32:09.383023"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "assignments".* FROM "assignments" WHERE "assignments"."practice_id" = $1  [["practice_id", 41]]
SELECT "horses".* FROM "horses" WHERE "horses"."id" = $1  [["id", 1]]
UPDATE "assignments" SET "user_id" = $1, "note" = $2, "updated_at" = $3 WHERE "assignments"."id" = $4  [["user_id", 1343], ["note", ""], ["updated_at", "2019-05-01 01:46:51.010116"], ["id", 1]]