app/controllers/horses_controller.rb

	def create
		@horse = Horse.new(horse_params)
		# This ensures that a name and age are filled out when
		# adding a horse as an officer
		if @horse.has_required_fields?
			@horse.save
---
INSERT INTO "horses" ("name", "age", "summary", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "asd"], ["age", 0], ["summary", "asd"], ["created_at", "2019-03-27 19:32:42.953259"], ["updated_at", "2019-03-27 19:32:42.953259"]]

	def edit
		@horse = Horse.find params[:format] # why is our id called format?
---
SELECT  "horses".* FROM "horses" WHERE "horses"."id" = $1 LIMIT 1  [["id", 1]]

	def save # can change create to just use save function after Horse.new
		@horse = Horse.find params[:format]
		if @horse.has_required_fields?
			@horse.update_attributes!(horse_params)
---
SELECT  "horses".* FROM "horses" WHERE "horses"."id" = $1 LIMIT 1  [["id", 14]]
UPDATE "horses" SET "name" = $1, "age" = $2, "summary" = $3, "updated_at" = $4 WHERE "horses"."id" = $5  [["name", "Horse No Ho Change"], ["age", 23], ["summary", "dsafasfsaChange"], ["updated_at", "2019-04-11 16:51:03.570577"], ["id", 15]]

	def delete
		@horse = Horse.find params[:format]
	    @horse.destroy
---
SELECT  "horses".* FROM "horses" WHERE "horses"."id" = $1 LIMIT 1  [["id", nil]]
DELETE FROM "horses" WHERE "horses"."id" = $1  [["id", 1]]

	def index
		@horses = Horse.all # Get all horses to be displayed
---
SELECT "horses".* FROM "horses"