app/controllers/practices_controller.rb

SELECT "practices".* FROM "practices" WHERE (date >= '2019-05-01 01:17:00.231301')  ORDER BY "practices"."date" ASC
---
  def show
  	@practices = Practice.all.order(:date) # Grab all users and order

INSERT INTO "practices" ("time", "date", "summary", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["time", "2019-04-16 12:31:00.000000"], ["date", "0312-12-12"], ["summary", "12"], ["user_id", 1], ["created_at", "2019-04-16 00:25:12.837134"], ["updated_at", "2019-04-16 00:25:12.837134"]]
---
  def create
  	@practice = Practice.new(practice_params)
  	@practice.user = current_user

  	if @practice.save