app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "jakefenger@gmail.com"]]
---
  def create

    # Grab user based on email
    user = User.find_by(email: params[:session][:email].downcase)