app/controllers/users_controller.rb

  def show
  	@users = User.all.order(:id) # Grab all users and order
---
SELECT "users".* FROM "users"  ORDER BY "users"."id" ASC