app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."role" = $1  ORDER BY first_name  [["role", "Officer"]]
---
  def show
    if(params[:officer_sort].nil? == false)
      @sortOfficers = params[:officer_sort]
    elsif(session[:current_officer_sort].nil? == false)
      @sortOfficers = session[:current_officer_sort]
      redNeed = true
    else
      @sortOfficers = "id"
    end

    if(params[:member_sort].nil? == false)
      @sortMembers = params[:member_sort]
    elsif(session[:current_member_sort].nil? == false)
      @sortMembers = session[:current_member_sort]
      redNeed = true
    else
      @sortMembers = "id"
    end

    if(redNeed == true)
      redirect_to users_path(:officer_sort => @sortOfficers, :member_sort => @sortMembers)
    end

    # o_sort = "LOWER(" + @sortOfficers + ")"
    # m_sort = "LOWER(" + @sortMembers + ")"
    @officers = User.where(role: 'Officer').order(@sortOfficers)

INSERT INTO "users" ("user_role", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_role", "member"], ["created_at", "2019-04-02 23:27:42.617823"], ["updated_at", "2019-04-02 23:27:42.617823"]]
---
  def create
  	@user = User.new(user_params)
  	@user.role = "Officer" # By default, set role to member

  	if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "users" SET "role" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["role", "officer"], ["updated_at", "2019-04-04 19:46:12.452280"], ["id", 1]]
---
  def promote
    user_id = params[:format]

    if user_id
      user = User.find_by_id(user_id)
      user.update_attribute(:role, "Officer")

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "users" SET "role" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["role", "Member"], ["updated_at", "2019-04-04 19:47:42.878775"], ["id", 1]]
---
  def demote
    user_id = params[:format]

    if user_id
      user = User.find_by_id(user_id)
      user.update_attribute(:role, "Member")